backend/views/layouts/main.php

/* @var $content string */

$settings = new common\models\Setting();
$settings = $settings->findOne(["status" => 1]);
---
SELECT * FROM `setting` WHERE `status`=1