common/components/MasterComponent.php

    public function  unread_notifications($user_id)
    {
           $unread_notification_count = \common\models\NotificationGeneralization::find()->where(['notification_to'=>$user_id,'is_read'=>0])->asarray()->all();
---
SELECT * FROM `notification_generalization` WHERE (`notification_to` IS NULL) AND (`is_read`=0)