common/models/LoginForm.php

    public function emailcheck($attribute, $params)
    {
         $user_deleted = User::find()->where([ 'status' => 1, "email" => $this->email,"role"=>['superAdmin','subAdmin']])->orderBy(['id' => SORT_DESC])->One();
---
SELECT * FROM `user` WHERE (`status`=1) AND (`email`='superadmin@gmail.com') AND (`role` IN ('superAdmin', 'subAdmin')) ORDER BY `id` DESC

    public function login() {

        if ($this->validate()) {

            $model = User::findByEmailLogin($this->email);
            if ($model->user_last_login == '') {
                $model->user_last_login = 'first_login';
            } else {
                $model->user_last_login = time();
            }
            $model->save(false);
---
UPDATE `user` SET `user_last_login`='1505839782', `updated_at`=1505839782 WHERE `id`=1