common/models/User.php

SELECT * FROM `user` WHERE email = 'superadmin@gmail.com' AND status = 1
---
    public static function findByEmailLogin($email) {

        return static::find()
                        ->where("email = '$email' AND status = 1")
                        ->one();