backend/views/site/index.php

SELECT COUNT(*) FROM `user` WHERE (`role`='student') AND (`status` <> 2)
SELECT COUNT(*) FROM `user` WHERE (`role`='tutor') AND (`status` <> 2)
SELECT COUNT(*) FROM `question` WHERE `status` <> 2
---
use yii\helpers\Url;
//echo \Yii::$app->user->identity->user_last_login;
$this->title = 'Dashboard';
$students = User::find()->where(['role'=>'student'])->andWhere(['<>', 'status', 2])->count();
$tutors = User::find()->where(['role'=>'tutor'])->andWhere(['<>', 'status', 2])->count();
$question = Question::find()->Where(['<>', 'status', 2])->count();;