backend/views/site/login.php

SELECT * FROM `setting` WHERE `setting_id`=1
---
    'options' => ['class' => 'form-group has-feedback'],
    'inputTemplate' => "{input}<span class='glyphicon glyphicon-lock form-control-feedback'></span>"
];
$settings = \common\models\Setting::findOne(['setting_id' => 1]);