frontend/views/layouts/main.php

SELECT * FROM `setting` WHERE `status`=1
---
AppAsset::register($this);

$settings = new common\models\Setting();
$settings = $settings->findOne(["status" => 1]);