frontend/models/LoginForm.php

    public function emailcheck($attribute, $params)
    {
        $user_exist = User::find()->where(["email" => $this->email])->orderBy(['id' => SORT_DESC])->one();

         if(empty($user_exist)){
           $this->addError($attribute, 'Email does not exist.');
         }
         $user_deleted = User::find()->where([ "email" => $this->email])->orderBy(['id' => SORT_DESC])->One();
---
SELECT * FROM `user` WHERE `email`='johnpenton@test.com' ORDER BY `id` DESC