frontend/views/site/needhelp.php

SELECT * FROM `setting` WHERE `status`=1
---
use common\components\GeneralComponent;

$settings = new common\models\Setting();
$settings = $settings->findOne(["status" => 1]);